tukano-artillery-tests/logs/db-postgres-33.txt
--------------------------------
Summary report @ 17:24:49(+0000)
--------------------------------

errors.ETIMEDOUT: .............................................................. 907
http.codes.200: ................................................................ 1291
http.codes.204: ................................................................ 890
http.downloaded_bytes: ......................................................... 225656
http.request_rate: ............................................................. 54/sec
http.requests: ................................................................. 3088
http.response_time:
  min: ......................................................................... 228
  max: ......................................................................... 10001
  mean: ........................................................................ 4460.3
  median: ...................................................................... 4316.6
  p95: ......................................................................... 9416.8
  p99: ......................................................................... 9999.2
http.response_time.2xx:
  min: ......................................................................... 228
  max: ......................................................................... 10001
  mean: ........................................................................ 4460.3
  median: ...................................................................... 4316.6
  p95: ......................................................................... 9416.8
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 2181
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/likes?pwd=pwd.codes.200: ..... 122
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/likes?pwd=pwd.errors.ETIME...  127
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd...  306
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd...  195
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/feed?pwd=pwd.codes.200: .. 96
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/feed?pwd=pwd.errors.ET...  26
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/followers?pwd=pwd.code...  249
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/followers?pwd=pwd.erro...  57
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts.codes.200: ........ 83
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts.errors.ETIMEDOUT: . 13
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts?pwd=pwd.codes.204:  83
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/{{ random_user_id }}/f...  501
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/{{ random_user_id }}/f...  240
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd=pwd.codes.200: ....... 741
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd=pwd.errors.ETIMEDOUT:  249
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ id }}/likes?pwd=pwd:
  min: ......................................................................... 533
  max: ......................................................................... 9994
  mean: ........................................................................ 4136.4
  median: ...................................................................... 982.6
  p95: ......................................................................... 9607.1
  p99: ......................................................................... 9999.2
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd:
  min: ......................................................................... 649
  max: ......................................................................... 10001
  mean: ........................................................................ 5706.3
  median: ...................................................................... 6312.2
  p95: ......................................................................... 9416.8
  p99: ......................................................................... 9801.2
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/feed?pwd=pwd:
  min: ......................................................................... 332
  max: ......................................................................... 9796
  mean: ........................................................................ 2475.4
  median: ...................................................................... 478.3
  p95: ......................................................................... 9416.8
  p99: ......................................................................... 9801.2
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/followers?pwd=pwd:
  min: ......................................................................... 333
  max: ......................................................................... 10000
  mean: ........................................................................ 5421.3
  median: ...................................................................... 6439.7
  p95: ......................................................................... 9607.1
  p99: ......................................................................... 9999.2
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/shorts:
  min: ......................................................................... 320
  max: ......................................................................... 9902
  mean: ........................................................................ 1306.7
  median: ...................................................................... 424.2
  p95: ......................................................................... 9230.4
  p99: ......................................................................... 9607.1
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/shorts?pwd=pwd:
  min: ......................................................................... 329
  max: ......................................................................... 8334
  mean: ........................................................................ 830.1
  median: ...................................................................... 424.2
  p95: ......................................................................... 2566.3
  p99: ......................................................................... 5168
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/{{ random_user_id }}/followers?pwd=pwd:
  min: ......................................................................... 437
  max: ......................................................................... 10001
  mean: ........................................................................ 4989.4
  median: ...................................................................... 4965.3
  p95: ......................................................................... 9607.1
  p99: ......................................................................... 9999.2
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd=pwd:
  min: ......................................................................... 228
  max: ......................................................................... 9553
  mean: ........................................................................ 4335.5
  median: ...................................................................... 3984.7
  p95: ......................................................................... 9230.4
  p99: ......................................................................... 9416.8
vusers.completed: .............................................................. 83
vusers.created: ................................................................ 990
vusers.created_by_name.DB Storage: ............................................. 990
vusers.failed: ................................................................. 907
vusers.session_length:
  min: ......................................................................... 4216.2
  max: ......................................................................... 44471.7
  mean: ........................................................................ 18590.1
  median: ...................................................................... 16159.7
  p95: ......................................................................... 43058.1
  p99: ......................................................................... 43928