tukano-artillery-tests/logs/delete-15-hibernate.txt
--------------------------------
Summary report @ 19:14:59(+0000)
--------------------------------

http.codes.200: ................................................................ 450
http.downloaded_bytes: ......................................................... 39282
http.request_rate: ............................................................. 15/sec
http.requests: ................................................................. 450
http.response_time:
  min: ......................................................................... 33
  max: ......................................................................... 5321
  mean: ........................................................................ 314.8
  median: ...................................................................... 53
  p95: ......................................................................... 1274.3
  p99: ......................................................................... 4965.3
http.response_time.2xx:
  min: ......................................................................... 33
  max: ......................................................................... 5321
  mean: ........................................................................ 314.8
  median: ...................................................................... 53
  p95: ......................................................................... 1274.3
  p99: ......................................................................... 4965.3
http.responses: ................................................................ 450
plugins.metrics-by-endpoint./rest/users/{{ userId }}?pwd=pwd.codes.200: ........ 450
plugins.metrics-by-endpoint.response_time./rest/users/{{ userId }}?pwd=pwd:
  min: ......................................................................... 33
  max: ......................................................................... 5321
  mean: ........................................................................ 314.8
  median: ...................................................................... 53
  p95: ......................................................................... 1274.3
  p99: ......................................................................... 4965.3
vusers.completed: .............................................................. 450
vusers.created: ................................................................ 450
vusers.created_by_name.DB Storage: ............................................. 450
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 192.5
  max: ......................................................................... 5478.1
  mean: ........................................................................ 503.9
  median: ...................................................................... 242.3
  p95: ......................................................................... 1556.5
  p99: ......................................................................... 5168