tukano-artillery-tests/logs/delete-33-hibernate.txt
--------------------------------
Summary report @ 19:53:04(+0000)
--------------------------------

errors.ETIMEDOUT: .............................................................. 208
http.codes.200: ................................................................ 782
http.downloaded_bytes: ......................................................... 68498
http.request_rate: ............................................................. 35/sec
http.requests: ................................................................. 990
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 9942
  mean: ........................................................................ 1562.7
  median: ...................................................................... 58.6
  p95: ......................................................................... 9047.6
  p99: ......................................................................... 9607.1
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 9942
  mean: ........................................................................ 1562.7
  median: ...................................................................... 58.6
  p95: ......................................................................... 9047.6
  p99: ......................................................................... 9607.1
http.responses: ................................................................ 782
plugins.metrics-by-endpoint./rest/users/{{ userId }}?pwd=pwd.codes.200: ........ 782
plugins.metrics-by-endpoint./rest/users/{{ userId }}?pwd=pwd.errors.ETIMEDOUT: . 208
plugins.metrics-by-endpoint.response_time./rest/users/{{ userId }}?pwd=pwd:
  min: ......................................................................... 1
  max: ......................................................................... 9942
  mean: ........................................................................ 1562.7
  median: ...................................................................... 58.6
  p95: ......................................................................... 9047.6
  p99: ......................................................................... 9607.1
vusers.completed: .............................................................. 782
vusers.created: ................................................................ 990
vusers.created_by_name.DB Storage: ............................................. 990
vusers.failed: ................................................................. 208
vusers.session_length:
  min: ......................................................................... 187.8
  max: ......................................................................... 10129.2
  mean: ........................................................................ 3897.7
  median: ...................................................................... 3984.7
  p95: ......................................................................... 9230.4
  p99: ......................................................................... 9999.2